---
kind: method
id: M:Autodesk.Revit.DB.LinkNode.GetDocument
source: html/cdb19e4d-ab0b-c0ed-1402-c7178022071e.htm
---
# Autodesk.Revit.DB.LinkNode.GetDocument Method

Returns the document associated with the link.

## Syntax (C#)
```csharp
public Document GetDocument()
```

## Returns
Instance of a Document

## Remarks
The document is in read-only state. Transactions are not allowed in it.